implement-verify-service/test-results/java-repo/store/diagrams/dependency-graph.dot
digraph Dependency_Graph {
    rankdir=TB;

    src_main_java_com_iluwatar_abstractdocument_AbstractDocument_java [label="src/main/java/com/iluwatar/abstractdocument/AbstractDocument.java", shape=box];
    java_util [label="java.util", shape=box];
    java_util_function [label="java.util.function", shape=box];
    java_util_stream [label="java.util.stream", shape=box];
    src_main_java_com_iluwatar_abstractdocument_App_java [label="src/main/java/com/iluwatar/abstractdocument/App.java", shape=box];
    com_iluwatar_abstractdocument_domain [label="com.iluwatar.abstractdocument.domain", shape=box];
    com_iluwatar_abstractdocument_domain_enums [label="com.iluwatar.abstractdocument.domain.enums", shape=box];
    lombok_extern_slf4j [label="lombok.extern.slf4j", shape=box];
    src_main_java_com_iluwatar_abstractdocument_Document_java [label="src/main/java/com/iluwatar/abstractdocument/Document.java", shape=box];
    src_main_java_com_iluwatar_abstractdocument_domain_Car_java [label="src/main/java/com/iluwatar/abstractdocument/domain/Car.java", shape=box];
    com_iluwatar_abstractdocument [label="com.iluwatar.abstractdocument", shape=box];
    src_main_java_com_iluwatar_abstractdocument_domain_HasModel_java [label="src/main/java/com/iluwatar/abstractdocument/domain/HasModel.java", shape=box];
    src_main_java_com_iluwatar_abstractdocument_domain_HasParts_java [label="src/main/java/com/iluwatar/abstractdocument/domain/HasParts.java", shape=box];
    src_main_java_com_iluwatar_abstractdocument_domain_HasPrice_java [label="src/main/java/com/iluwatar/abstractdocument/domain/HasPrice.java", shape=box];
    src_main_java_com_iluwatar_abstractdocument_domain_HasType_java [label="src/main/java/com/iluwatar/abstractdocument/domain/HasType.java", shape=box];
    src_main_java_com_iluwatar_abstractdocument_domain_Part_java [label="src/main/java/com/iluwatar/abstractdocument/domain/Part.java", shape=box];
    src_test_java_com_iluwatar_abstractdocument_AbstractDocumentTest_java [label="src/test/java/com/iluwatar/abstractdocument/AbstractDocumentTest.java", shape=box];
    org_junit_jupiter_api_Assertions [label="org.junit.jupiter.api.Assertions", shape=box];
    org_junit_jupiter_api [label="org.junit.jupiter.api", shape=box];
    src_test_java_com_iluwatar_abstractdocument_AppTest_java [label="src/test/java/com/iluwatar/abstractdocument/AppTest.java", shape=box];
    src_test_java_com_iluwatar_abstractdocument_DomainTest_java [label="src/test/java/com/iluwatar/abstractdocument/DomainTest.java", shape=box];

    src_main_java_com_iluwatar_abstractdocument_AbstractDocument_java -> java_util [];
    src_main_java_com_iluwatar_abstractdocument_AbstractDocument_java -> java_util_function [];
    src_main_java_com_iluwatar_abstractdocument_AbstractDocument_java -> java_util_stream [];
    src_main_java_com_iluwatar_abstractdocument_App_java -> com_iluwatar_abstractdocument_domain [];
    src_main_java_com_iluwatar_abstractdocument_App_java -> com_iluwatar_abstractdocument_domain_enums [];
    src_main_java_com_iluwatar_abstractdocument_App_java -> java_util [];
    src_main_java_com_iluwatar_abstractdocument_App_java -> lombok_extern_slf4j [];
    src_main_java_com_iluwatar_abstractdocument_Document_java -> java_util [];
    src_main_java_com_iluwatar_abstractdocument_Document_java -> java_util_function [];
    src_main_java_com_iluwatar_abstractdocument_Document_java -> java_util_stream [];
    src_main_java_com_iluwatar_abstractdocument_domain_Car_java -> com_iluwatar_abstractdocument [];
    src_main_java_com_iluwatar_abstractdocument_domain_Car_java -> java_util [];
    src_main_java_com_iluwatar_abstractdocument_domain_HasModel_java -> com_iluwatar_abstractdocument [];
    src_main_java_com_iluwatar_abstractdocument_domain_HasModel_java -> com_iluwatar_abstractdocument_domain_enums [];
    src_main_java_com_iluwatar_abstractdocument_domain_HasModel_java -> java_util [];
    src_main_java_com_iluwatar_abstractdocument_domain_HasParts_java -> com_iluwatar_abstractdocument [];
    src_main_java_com_iluwatar_abstractdocument_domain_HasParts_java -> com_iluwatar_abstractdocument_domain_enums [];
    src_main_java_com_iluwatar_abstractdocument_domain_HasParts_java -> java_util_stream [];
    src_main_java_com_iluwatar_abstractdocument_domain_HasPrice_java -> com_iluwatar_abstractdocument [];
    src_main_java_com_iluwatar_abstractdocument_domain_HasPrice_java -> com_iluwatar_abstractdocument_domain_enums [];
    src_main_java_com_iluwatar_abstractdocument_domain_HasPrice_java -> java_util [];
    src_main_java_com_iluwatar_abstractdocument_domain_HasType_java -> com_iluwatar_abstractdocument [];
    src_main_java_com_iluwatar_abstractdocument_domain_HasType_java -> com_iluwatar_abstractdocument_domain_enums [];
    src_main_java_com_iluwatar_abstractdocument_domain_HasType_java -> java_util [];
    src_main_java_com_iluwatar_abstractdocument_domain_Part_java -> com_iluwatar_abstractdocument [];
    src_main_java_com_iluwatar_abstractdocument_domain_Part_java -> java_util [];
    src_test_java_com_iluwatar_abstractdocument_AbstractDocumentTest_java -> org_junit_jupiter_api_Assertions [];
    src_test_java_com_iluwatar_abstractdocument_AbstractDocumentTest_java -> java_util [];
    src_test_java_com_iluwatar_abstractdocument_AbstractDocumentTest_java -> org_junit_jupiter_api [];
    src_test_java_com_iluwatar_abstractdocument_AppTest_java -> org_junit_jupiter_api_Assertions [];
    src_test_java_com_iluwatar_abstractdocument_AppTest_java -> org_junit_jupiter_api [];
    src_test_java_com_iluwatar_abstractdocument_DomainTest_java -> org_junit_jupiter_api_Assertions [];
    src_test_java_com_iluwatar_abstractdocument_DomainTest_java -> com_iluwatar_abstractdocument_domain [];
    src_test_java_com_iluwatar_abstractdocument_DomainTest_java -> com_iluwatar_abstractdocument_domain_enums [];
    src_test_java_com_iluwatar_abstractdocument_DomainTest_java -> java_util [];
    src_test_java_com_iluwatar_abstractdocument_DomainTest_java -> org_junit_jupiter_api [];
}
