implement-verify-service/test-results/java-repo/store/diagrams/dependency-graph.puml
@startuml
title Dependency Graph

[src/main/java/com/iluwatar/abstractdocument/AbstractDocument.java] --> [java.util]
[src/main/java/com/iluwatar/abstractdocument/AbstractDocument.java] --> [java.util.function]
[src/main/java/com/iluwatar/abstractdocument/AbstractDocument.java] --> [java.util.stream]
[src/main/java/com/iluwatar/abstractdocument/App.java] --> [com.iluwatar.abstractdocument.domain]
[src/main/java/com/iluwatar/abstractdocument/App.java] --> [com.iluwatar.abstractdocument.domain.enums]
[src/main/java/com/iluwatar/abstractdocument/App.java] --> [java.util]
[src/main/java/com/iluwatar/abstractdocument/App.java] --> [lombok.extern.slf4j]
[src/main/java/com/iluwatar/abstractdocument/Document.java] --> [java.util]
[src/main/java/com/iluwatar/abstractdocument/Document.java] --> [java.util.function]
[src/main/java/com/iluwatar/abstractdocument/Document.java] --> [java.util.stream]
[src/main/java/com/iluwatar/abstractdocument/domain/Car.java] --> [com.iluwatar.abstractdocument]
[src/main/java/com/iluwatar/abstractdocument/domain/Car.java] --> [java.util]
[src/main/java/com/iluwatar/abstractdocument/domain/HasModel.java] --> [com.iluwatar.abstractdocument]
[src/main/java/com/iluwatar/abstractdocument/domain/HasModel.java] --> [com.iluwatar.abstractdocument.domain.enums]
[src/main/java/com/iluwatar/abstractdocument/domain/HasModel.java] --> [java.util]
[src/main/java/com/iluwatar/abstractdocument/domain/HasParts.java] --> [com.iluwatar.abstractdocument]
[src/main/java/com/iluwatar/abstractdocument/domain/HasParts.java] --> [com.iluwatar.abstractdocument.domain.enums]
[src/main/java/com/iluwatar/abstractdocument/domain/HasParts.java] --> [java.util.stream]
[src/main/java/com/iluwatar/abstractdocument/domain/HasPrice.java] --> [com.iluwatar.abstractdocument]
[src/main/java/com/iluwatar/abstractdocument/domain/HasPrice.java] --> [com.iluwatar.abstractdocument.domain.enums]
[src/main/java/com/iluwatar/abstractdocument/domain/HasPrice.java] --> [java.util]
[src/main/java/com/iluwatar/abstractdocument/domain/HasType.java] --> [com.iluwatar.abstractdocument]
[src/main/java/com/iluwatar/abstractdocument/domain/HasType.java] --> [com.iluwatar.abstractdocument.domain.enums]
[src/main/java/com/iluwatar/abstractdocument/domain/HasType.java] --> [java.util]
[src/main/java/com/iluwatar/abstractdocument/domain/Part.java] --> [com.iluwatar.abstractdocument]
[src/main/java/com/iluwatar/abstractdocument/domain/Part.java] --> [java.util]
[src/test/java/com/iluwatar/abstractdocument/AbstractDocumentTest.java] --> [org.junit.jupiter.api.Assertions]
[src/test/java/com/iluwatar/abstractdocument/AbstractDocumentTest.java] --> [java.util]
[src/test/java/com/iluwatar/abstractdocument/AbstractDocumentTest.java] --> [org.junit.jupiter.api]
[src/test/java/com/iluwatar/abstractdocument/AppTest.java] --> [org.junit.jupiter.api.Assertions]
[src/test/java/com/iluwatar/abstractdocument/AppTest.java] --> [org.junit.jupiter.api]
[src/test/java/com/iluwatar/abstractdocument/DomainTest.java] --> [org.junit.jupiter.api.Assertions]
[src/test/java/com/iluwatar/abstractdocument/DomainTest.java] --> [com.iluwatar.abstractdocument.domain]
[src/test/java/com/iluwatar/abstractdocument/DomainTest.java] --> [com.iluwatar.abstractdocument.domain.enums]
[src/test/java/com/iluwatar/abstractdocument/DomainTest.java] --> [java.util]
[src/test/java/com/iluwatar/abstractdocument/DomainTest.java] --> [org.junit.jupiter.api]

@enduml
